package com.example.learnapplication

class NumberArraysGeorgian {
    //ერთეულები
    val singleDigit =
        arrayOf("ნული", "ერთი", "ორი", "სამი", "ოთხი", "ხუთი", "ექვსი", "შვიდი", "რვა", "ცხრა")

    //ათობითის ადგილი
    val twoDigits = arrayOf(
        "ათი",
        "თერთმეტი",
        "თორმეტი",
        "ცამეტი",
        "თოთხმეტი",
        "თხუთმეტი",
        "თექვსმეტი",
        "ჩვიდმეტი",
        "თვრამეტი",
        "ცხრამეტი"
    )

    //ათის ჯერადები
    val tenMultiples = arrayOf(
        "",
        "ათი",
        "ოცი",
        "ოცდაათი",
        "ორმოცი",
        "ორმოცდათი",
        "სამოცი",
        "სამოცდაათი",
        "ოთხმოცი",
        "ოთმოხცდაათი"
    )

    val tensPlaceCompound = arrayOf(
       "",
        "",
        "ოცდა",
        "ოცდა",
        "ორმოცდა",
        "ორმოცდა",
        "სამოცდა",
        "სამოცდა",
        "ოთხმოცდა",
        "ოთხმოცდა"
    )

    // ასეულები
    val threeDigits = arrayOf(
        "",
        "ას",
        "ორას",
        "სამას",
        "ოთხას",
        "ხუთას",
        "ექვსას",
        "შვიდას",
        "რვაას",
        "ცხრაას"
    )

}